In [101]:
import pandas as pd
import numpy as np

In [4]:
import gdown

In [6]:
gdown.download('https://bit.ly/3RhoNho','ns_202104.csv',quiet=False)

Downloading...
From: https://bit.ly/3RhoNho
To: c:\work\ns_202104.csv
100%|███████████████████████████████████████████████████████████████████████████████████| 57.6M/57.6M [00:33<00:00, 1.71MB/s]

'ns_202104.csv'

In [102]:
test = pd.read_csv('test.csv')

In [119]:
# 눈으로 확인(데이터 값)
test.head()
# dataFrame의 정체를 확인
test.shape
## data구성
test.dtypes
## 변수구성
test.columns
## 

test['방문회수비율'] = test.박물관방문 / test.나이

In [123]:
test['방문회수비율'] = round(test.방문회수비율,2)

    이름  나이  박물관방문  방문회수비율
0  김담향  33      5    0.15
1  이재빈  25     10    0.40
2  김나영  26      4    0.15

In [124]:
test['성별'] = '여자'

In [127]:
test.iloc[1,4] = '남성'

In [133]:
print(test)
test.loc[test.이름 == '이재빈','성별'] = '남자'
test

    이름  나이  박물관방문  방문회수비율  성별
0  김담향  33      5    0.15  여자
1  이재빈  25     10    0.40  남성
2  김나영  26      4    0.15  여자

    이름  나이  박물관방문  방문회수비율  성별
0  김담향  33      5    0.15  여자
1  이재빈  25     10    0.40  남자
2  김나영  26      4    0.15  여자

In [140]:
new_dic = {'이름':['김건우'],
'나이':[28],
'박물관방문':[10],
'방문회수비율':[10/28],
'성별':['남자']}

new_member = pd.DataFrame(new_dic)
new_member.index = [1]

In [141]:
new_member

    이름  나이  박물관방문    방문회수비율  성별
1  김건우  28     10  0.357143  남자

In [145]:
test = pd.concat([test,new_member],axis=0)

In [154]:
test

    이름  나이  박물관방문    방문회수비율  성별
0  김담향  33      5  0.150000  여자
1  이재빈  25     10  0.400000  남자
2  김나영  26      4  0.150000  여자
1  김건우  28     10  0.357143  남자

In [160]:
test.loc[test.성별 == '남자','박물관방문'] = test.loc[test.성별 == '남자','박물관방문'] - 3
test.loc[test.성별 == '남자','박물관방문'] -= 3
test

    이름  나이  박물관방문    방문회수비율  성별
0  김담향  33      5  0.150000  여자
1  이재빈  25      1  0.400000  남자
2  김나영  26      4  0.150000  여자
1  김건우  28      1  0.357143  남자

In [167]:
test.iloc[[0,2],[0,1]]
test.iloc[[1,3],[0,1]]
test.loc[[0,2],['이름','나이']]
test.loc[[1],["이름","나이"]]

    이름  나이
1  이재빈  25
1  김건우  28

In [169]:
new_member = {
    '이름':['김태영','김동일'],
    '나이':[26,26],
    '박물관방문':[20,21],
    '성별':['남자','남자']
}

new_member = pd.DataFrame(new_member)
new_member

    이름  나이  박물관방문  성별
0  김태영  26     20  남자
1  김동일  26     21  남자

In [170]:
new_member['방문회수비율'] = new_member['박물관방문']/new_member.나이

In [173]:
test = pd.concat([test,new_member])
test

    이름  나이  박물관방문    방문회수비율  성별
0  김담향  33      5  0.150000  여자
1  이재빈  25      1  0.400000  남자
2  김나영  26      4  0.150000  여자
1  김건우  28      1  0.357143  남자
0  김태영  26     20  0.769231  남자
1  김동일  26     21  0.807692  남자

In [174]:
test.index = np.arange(test.shape[0])
test

    이름  나이  박물관방문    방문회수비율  성별
0  김담향  33      5  0.150000  여자
1  이재빈  25      1  0.400000  남자
2  김나영  26      4  0.150000  여자
3  김건우  28      1  0.357143  남자
4  김태영  26     20  0.769231  남자
5  김동일  26     21  0.807692  남자

In [177]:
test.set_index('이름').to_csv("abc.csv",index=None)

In [178]:
abc = pd.read_csv("abc.csv")

In [181]:
test.set_index('이름',inplace=True)
test

     나이  박물관방문    방문회수비율  성별
이름
김담향  33      5  0.150000  여자
이재빈  25      1  0.400000  남자
김나영  26      4  0.150000  여자
김건우  28      1  0.357143  남자
김태영  26     20  0.769231  남자
김동일  26     21  0.807692  남자

In [182]:
test.loc['김담향','방문회수비율']

0.15

In [186]:
test.reset_index(inplace=True)
test

    이름  나이  박물관방문    방문회수비율  성별
0  김담향  33      5  0.150000  여자
1  이재빈  25      1  0.400000  남자
2  김나영  26      4  0.150000  여자
3  김건우  28      1  0.357143  남자
4  김태영  26     20  0.769231  남자
5  김동일  26     21  0.807692  남자

In [190]:
test.loc[test.이름=='김담향','방문회수비율']

0    0.15
Name: 방문회수비율, dtype: float64

In [192]:
test

    이름  나이  박물관방문    방문회수비율  성별
0  김담향  33      5  0.150000  여자
1  이재빈  25      1  0.400000  남자
2  김나영  26      4  0.150000  여자
3  김건우  28      1  0.357143  남자
4  김태영  26     20  0.769231  남자
5  김동일  26     21  0.807692  남자

In [194]:
[1,2,3,4,5,6][1:4]

[2, 3, 4]

In [195]:
test.loc[1:4,'나이':'방문회수비율']

   나이  박물관방문    방문회수비율
1  25      1  0.400000
2  26      4  0.150000
3  28      1  0.357143
4  26     20  0.769231

In [198]:
test.iloc[1:5,1:4]

   나이  박물관방문    방문회수비율
1  25      1  0.400000
2  26      4  0.150000
3  28      1  0.357143
4  26     20  0.769231

In [203]:
test.이름.str.slice(0,1) == '김'

0     True
1    False
2     True
3     True
4     True
5     True
Name: 이름, dtype: bool

In [207]:
pd.concat([(test.이름.str.slice(0,1) == '김'),
(test.나이 >= 28),
(test.나이 >= 28) & (test.이름.str.slice(0,1) == '김')],axis=1)

      이름     나이      0
0   True   True   True
1  False  False  False
2   True  False  False
3   True   True   True
4   True  False  False
5   True  False  False

In [209]:
test

    이름  나이  박물관방문    방문회수비율  성별
0  김담향  33      5  0.150000  여자
1  이재빈  25      1  0.400000  남자
2  김나영  26      4  0.150000  여자
3  김건우  28      1  0.357143  남자
4  김태영  26     20  0.769231  남자
5  김동일  26     21  0.807692  남자

In [214]:
arr = ((test.나이 >= 28) & (test.이름.str.slice(0,1) == '김')).values

In [217]:
((test.나이 >= 28) & (test.이름.str.slice(0,1) == '김')).values

array([ True, False, False,  True, False, False])

In [215]:
test.loc[(test.나이 >= 28) & (test.이름.str.slice(0,1) == '김'),["이름","성별"]]
test.iloc[arr,[0,4]]

    이름  성별
0  김담향  여자
3  김건우  남자

In [218]:
test1 = pd.DataFrame(
    {
        '이름':['명하영','조가영','강다솜'],
        '나이':[27,28,27],
        '박물관방문':[8,9,np.nan],
    }
)

In [221]:
test = pd.concat([test,test1])

In [224]:
test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9 entries, 0 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      9 non-null      object
 1   나이      9 non-null      int64
 2   박물관방문   8 non-null      float64
 3   방문회수비율  6 non-null      float64
 4   성별      6 non-null      object
dtypes: float64(2), int64(1), object(2)
memory usage: 432.0+ bytes

In [226]:
test.박물관방문.isna()

0    False
1    False
2    False
3    False
4    False
5    False
0    False
1    False
2     True
Name: 박물관방문, dtype: bool

In [227]:
test.loc[test.박물관방문.isna(),"박물관방문"]

2   NaN
Name: 박물관방문, dtype: float64

In [230]:
test.박물관방문.mean()

8.625

In [232]:
test.박물관방문.fillna(test.박물관방문.mean(),inplace=True)
test

    이름  나이   박물관방문    방문회수비율   성별
0  김담향  33   5.000  0.150000   여자
1  이재빈  25   1.000  0.400000   남자
2  김나영  26   4.000  0.150000   여자
3  김건우  28   1.000  0.357143   남자
4  김태영  26  20.000  0.769231   남자
5  김동일  26  21.000  0.807692   남자
0  명하영  27   8.000       NaN  NaN
1  조가영  28   9.000       NaN  NaN
2  강다솜  27   8.625       NaN  NaN

In [1]:
test.iloc[test.방문회수비율.isna().values,3] = test.iloc[test.방문회수비율.isna().values,2] /  test.iloc[test.방문회수비율.isna().values,1]

NameError: name 'test' is not defined

In [236]:
test.iloc[test.방문회수비율.isna().values,3] = \
test.iloc[test.방문회수비율.isna().values,2] / \
test.iloc[test.방문회수비율.isna().values,1]

In [245]:
test.박물관방문 = test.박물관방문.astype(int)

In [283]:
tmp = pd.DataFrame(np.vstack([test.values,np.array(['이강욱',43,100,100/43,'남자'])]))

In [264]:
np.array(['이강욱',43,100,100/43,'남자']).dtype

dtype('<U32')

In [284]:
tmp.columns = test.columns
tmp

    이름  나이 박물관방문              방문회수비율  성별
0  김담향  33     5                0.15  여자
1  이재빈  25     1                 0.4  남자
2  김나영  26     4                0.15  여자
3  김건우  28     1            0.357143  남자
4  김태영  26    20            0.769231  남자
5  김동일  26    21            0.807692  남자
6  명하영  27     8            0.296296  여자
7  조가영  28     9            0.321429  여자
8  강다솜  27     8            0.319444  여자
9  이강욱  43   100  2.3255813953488373  남자

In [319]:
def mk_str(x):
    r = ''
    for i in x:
        r += str(i)
    return r
mk_str(tmp.iloc[0,:])

'김담향3350.15여자'

In [309]:
tmp = pd.concat([tmp,tmp.iloc[[0,3,7],:]])
tmp

    이름  나이  박물관방문    방문회수비율  성별
0  김담향  33      5  0.150000  여자
1  이재빈  25      1  0.400000  남자
2  김나영  26      4  0.150000  여자
3  김건우  28      1  0.357143  남자
4  김태영  26     20  0.769231  남자
5  김동일  26     21  0.807692  남자
6  명하영  27      8  0.296296  여자
7  조가영  28      9  0.321429  여자
8  강다솜  27      8  0.319444  여자
9  이강욱  43    100  2.325581  남자
0  김담향  33      5  0.150000  여자
3  김건우  28      1  0.357143  남자
7  조가영  28      9  0.321429  여자

In [267]:
tmp.나이 = tmp.나이.astype('object')

In [278]:
aljjlkfalkjdfa = 10
try:
    print(aljjlkfal3343kjdfa)
except:
    print('무슨문장야?')

무슨문장야?

In [285]:
tmp.dtypes

이름        object
나이        object
박물관방문     object
방문회수비율    object
성별        object
dtype: object

In [286]:
for col in tmp.columns:
    try:
        tmp[col] = tmp[col].astype(int)
    except:
        try:
            tmp[col] = tmp[col].astype(float)
        except:
            pass

In [307]:
tmp.loc[~tmp.이름.str.contains('김') & ~(tmp.이름=='이강욱'),'나이'].mean()

26.75

In [293]:
tmp.이름.str[0:1]

0    김
1    이
2    김
3    김
4    김
5    김
6    명
7    조
8    강
9    이
Name: 이름, dtype: object

In [256]:
tmp.loc[tmp.이름!='이강욱',:]

    이름  나이 박물관방문    방문회수비율  성별
0  김담향  33     5      0.15  여자
1  이재빈  25     1       0.4  남자
2  김나영  26     4      0.15  여자
3  김건우  28     1  0.357143  남자
4  김태영  26    20  0.769231  남자
5  김동일  26    21  0.807692  남자
6  명하영  27     8  0.296296  여자
7  조가영  28     9  0.321429  여자
8  강다솜  27     8  0.319444  여자

In [261]:
tmp.dtypes

이름        object
나이        object
박물관방문     object
방문회수비율    object
성별        object
dtype: object

In [240]:
test.loc[test.성별.isna(),'성별'] = '여자'
test

    이름  나이   박물관방문    방문회수비율  성별
0  김담향  33   5.000  0.150000  여자
1  이재빈  25   1.000  0.400000  남자
2  김나영  26   4.000  0.150000  여자
3  김건우  28   1.000  0.357143  남자
4  김태영  26  20.000  0.769231  남자
5  김동일  26  21.000  0.807692  남자
0  명하영  27   8.000  0.296296  여자
1  조가영  28   9.000  0.321429  여자
2  강다솜  27   8.625  0.319444  여자

In [191]:
test.set_index('이름').loc["김담향","방문회수비율"]

0.15

In [7]:
df = pd.read_csv('https://bit.ly/3RhoNho')

C:\Users\user\AppData\Local\Temp\ipykernel_6148\369920610.py:1: DtypeWarning: Columns (5,6,9) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('https://bit.ly/3RhoNho')

In [8]:
df.head()

,번호,도서명,저자,출판사,발행년도,ISBN,세트 ISBN,부가기호,권,주제분류번호,도서권수,대출건수,등록일자,Unnamed: 13
0,1,인공지능과 흙,김동훈 지음,민음사,2021,9788937444319,NaN,NaN,NaN,NaN,1,0,2021-03-19,NaN
1,2,가짜 행복 권하는 사회,김태형 지음,갈매나무,2021,9791190123969,NaN,NaN,NaN,NaN,1,0,2021-03-19,NaN
2,3,나도 한 문장 잘 쓰면 바랄 게 없겠네,김선영 지음,블랙피쉬,2021,9788968332982,NaN,NaN,NaN,NaN,1,0,2021-03-19,NaN
3,4,예루살렘 해변,"이도 게펜 지음, 임재희 옮김",문학세계사,2021,9788970759906,NaN,NaN,NaN,NaN,1,0,2021-03-19,NaN
4,5,김성곤의 중국한시기행 : 장강·황하 편,김성곤 지음,김영사,2021,9788934990833,NaN,NaN,NaN,NaN,1,0,2021-03-19,NaN

In [9]:
df.shape

(401682, 14)

In [16]:
len(df.columns)
df.shape[1]
df.columns.size-1

13

In [21]:
df.columns[:-1]

Index(['번호', '도서명', '저자', '출판사', '발행년도', 'ISBN', '세트 ISBN', '부가기호', '권',
       '주제분류번호', '도서권수', '대출건수', '등록일자'],
      dtype='object')

In [23]:
[True]*13+[False]

[True,
 True,
 True,
 True,
 True,
 True,
 True,
 True,
 True,
 True,
 True,
 True,
 True,
 False]

In [29]:
~(df.columns==df.columns[-1])

array([ True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True, False])

In [33]:
df.columns[-1]

'Unnamed: 13'

In [39]:
df.iloc[:,:-1].head()
df.iloc[:,:df.columns.size-1]
df.loc[:,'번호':'등록일자']
df.loc[:,df.columns[:-1]]
df.loc[:,[True]*13+[False]]
df.iloc[:,np.arange(13)]
df.loc[:,~(df.columns==df.columns[-1])]
#df = df.loc[:,df.columns != df.columns[-1]]
df.drop(columns=['Unnamed: 13'])
df.drop(columns=df.columns[-1])
#df.drop(['Unnamed: 13'],axis=1,inplace=True)

,번호,도서명,저자,출판사,발행년도,ISBN,세트 ISBN,부가기호,권,주제분류번호,도서권수,대출건수,등록일자
0,1,인공지능과 흙,김동훈 지음,민음사,2021,9788937444319,NaN,NaN,NaN,NaN,1,0,2021-03-19
1,2,가짜 행복 권하는 사회,김태형 지음,갈매나무,2021,9791190123969,NaN,NaN,NaN,NaN,1,0,2021-03-19
2,3,나도 한 문장 잘 쓰면 바랄 게 없겠네,김선영 지음,블랙피쉬,2021,9788968332982,NaN,NaN,NaN,NaN,1,0,2021-03-19
3,4,예루살렘 해변,"이도 게펜 지음, 임재희 옮김",문학세계사,2021,9788970759906,NaN,NaN,NaN,NaN,1,0,2021-03-19
4,5,김성곤의 중국한시기행 : 장강·황하 편,김성곤 지음,김영사,2021,9788934990833,NaN,NaN,NaN,NaN,1,0,2021-03-19
...,...,...,...,...,...,...,...,...,...,...,...,...,...
401677,401678,韓國現代詩大系,채만묵 編著,한국문화사,1996,9788977352971,9788977352988.0,NaN,3,811.608,1,0,1970-01-01
401678,401679,뉴 웨이브,제임스 모나코 지음,한나래,1996,9788985367448,9788985367424.0,NaN,2,688.04,1,0,1970-01-01
401679,401680,(최인훈 장편소설)화두,최인훈 지음,민음사,1994,9788937401596,9788937401589.0,NaN,2,813.6,1,0,1970-01-01
401680,401681,독일 문학과 세계 문학,吳漢鎭 編著,벽호,1995,9788947700368,9788947700405.0,NaN,3,809.05,2,0,1970-01-01
401681,401682,참으로 소중한 생각,김일상 지음,동문사,1995,9788970610092,9788970610092.0,0,1,814.6,0,0,1970-01-01

In [41]:
df.drop(df.columns[-1],axis=1,inplace=True)
df.head()

,번호,도서명,저자,출판사,발행년도,ISBN,세트 ISBN,부가기호,권,주제분류번호,도서권수,대출건수,등록일자
0,1,인공지능과 흙,김동훈 지음,민음사,2021,9788937444319,NaN,NaN,NaN,NaN,1,0,2021-03-19
1,2,가짜 행복 권하는 사회,김태형 지음,갈매나무,2021,9791190123969,NaN,NaN,NaN,NaN,1,0,2021-03-19
2,3,나도 한 문장 잘 쓰면 바랄 게 없겠네,김선영 지음,블랙피쉬,2021,9788968332982,NaN,NaN,NaN,NaN,1,0,2021-03-19
3,4,예루살렘 해변,"이도 게펜 지음, 임재희 옮김",문학세계사,2021,9788970759906,NaN,NaN,NaN,NaN,1,0,2021-03-19
4,5,김성곤의 중국한시기행 : 장강·황하 편,김성곤 지음,김영사,2021,9788934990833,NaN,NaN,NaN,NaN,1,0,2021-03-19

In [65]:
# null, None, NaN, na
# null == '', None == empty, NaN == Not a Number, na == Not Acceptible
pd.Series(np.array([np.nan, None, 1, 2]))
# pd.DataFrame(np.array([np.nan, None, 1, 2])).isna()
# pd.DataFrame(np.array([np.nan, None, 1, 2])).isnull()
#pd.DataFrame(np.array([np.nan, None, 1, 2])).dropna()

0     NaN
1    None
2       1
3       2
dtype: object

In [55]:
df.shape[0] - df.dropna().shape[0]

365855

In [56]:
df.shape[1] - df.dropna(axis=1).shape[1]

8

In [68]:
df.dropna(how="all")
df.dropna(how="any")
df.dropna(how='all',axis=1)
df.dropna(thresh=2)

401682

In [88]:
## 컬럼이 na가 70%이상인 컬럼을 지우고

# first step 70% 이상인거 찾기 
df.isna().sum()/df.shape[0]
# 컬럼명만 가져오기
remove_cols = df.columns[df.isna().sum()/df.shape[0] > 0.7]
# 컬럼지우기
df.drop(columns=remove_cols,inplace=True)

## 행이 na가 20% 이상인 행을 지우고 남은 na의 갯수를 구하면?
remove_row = ((df.isna().sum(axis=1) / df.shape[1]) > 0.2)

## 행지우기
df = df.loc[remove_row,:]

## 전체 na개수
df.isna().sum().sum()

In [332]:
df.columns

Index(['번호', '도서명', '저자', '출판사', '발행년도', 'ISBN', '부가기호', '주제분류번호', '도서권수',
       '대출건수', '등록일자'],
      dtype='object')

In [333]:
np.sum(df.iloc[:,[1,2,5]].duplicated())

12

In [331]:
np.sum(df.duplicated(subset=['도서명','저자','ISBN']))

12

In [350]:
## groupby : split --> apply --> combine
tmp['방문등급'] = np.where(tmp.박물관방문 >= 20,'A',
                      np.where(tmp.박물관방문 >= 9,'B','C'))
tmp

    이름  나이  박물관방문    방문회수비율  성별 방문등급
0  김담향  33      5  0.150000  여자    C
1  이재빈  25      1  0.400000  남자    C
2  김나영  26      4  0.150000  여자    C
3  김건우  28      1  0.357143  남자    C
4  김태영  26     20  0.769231  남자    A
5  김동일  26     21  0.807692  남자    A
6  명하영  27      8  0.296296  여자    C
7  조가영  28      9  0.321429  여자    B
8  강다솜  27      8  0.319444  여자    C
9  이강욱  43    100  2.325581  남자    A
0  김담향  33      5  0.150000  여자    C
3  김건우  28      1  0.357143  남자    C
7  조가영  28      9  0.321429  여자    B

In [345]:
x = np.random.randint(50,101,100_000_000)

In [346]:
## 90이상은 'A'
## 80~90미만은 'B'
## 70~80미만은 'C'
## 70미만은 'D'
score = []
for i in x:
    if i >= 90:
        score.append('A')
    else:
        if i >= 80:
            score.append('B')
        else:
            if i >= 70:
                score.append('C')
            else:
                score.append('D')

In [347]:
len(score)

100000000

In [348]:
score1 = np.where(x >= 90,'A',
        np.where(x>=80,'B',
                np.where(x>=70,'C','D')))